package com.hfad.lifer;

import android.content.ContentValues;
import android.content.Context;
import android.database.sqlite.SQLiteDatabase;
import android.database.sqlite.SQLiteOpenHelper;

/**
 * Created by user on 16.07.2017.
 */

public class DBHelper extends SQLiteOpenHelper{

    DBHelper (Context context) {
        super(context, "LiferDB",null, 1);
    }

    @Override
    public void onCreate(SQLiteDatabase db) {
        db.execSQL("CREATE TABLE CARDS ("
                + "NUMBER,"
                +"TEXT, "
                +"IMAGE_RESOURCE_ID, "
                +"LEFT_BTN_TXT, "
                +"RIGHT_BTN_TXT, "
                +"LEFT_CASH, "
                +"LEFT_HEALTH, "
                +"LEFT_RESPECT, "
                +"LEFT_DANGER,"
                +"RIGHT_CASH, "
                +"RIGHT_HEALTH, "
                +"RIGHT_RESPECT, "
                +"RIGHT_DANGER);");

        // Карточки для начала игры
        insertCard(db, "11", "В игре вам будут выпадать карточки с действиями",
                R.drawable.img11, "Да", "Да",
                1, 0, 0, 0, 1, 0, 0, 0);
        insertCard(db, "12", "В игре вам будут выпадать карточки с действиями",
                R.drawable.img12, "Ок", "Ок",
                1, 0, 0, 0, 1, 0, 0, 0);
        insertCard(db, "21", "Каждое решение будет влиять на четыре параметра сверху",
                R.drawable.img21, "Ок", "Ок",
                1, 0, 0, 0, 1, 0, 0, 0);
        insertCard(db, "22", "Каждое решение будет влиять на четыре параметра сверху",
                R.drawable.img22, "Ок", "Ок",
                1, 0, 0, 0, 1, 0, 0, 0);
        insertCard(db, "31", "Если один из них опустится до нуля, игра будет закончена",
                R.drawable.img31, "Начать", "Начать",
                -224, 0, 0, 0, -224, 0, 0, 0);
        insertCard(db, "32", "Если один из них опустится до нуля, игра будет закончена",
                R.drawable.img32, "Начать", "Начать",
                -224, 0, 0, 0, -224, 0, 0, 0);

        // Карточки для конца игры
        insertCard(db, "01111", "Вам нечего есть, вы умираете от истощения",
                R.drawable.img01111, "Начать снова", "Начать снова",
                2000, 0, 0, 0, 0, 0, 0, 0);
        insertCard(db, "01112", "Вам нечего есть, вы умираете от истощения",
                R.drawable.img01111, "играть заново", "играть заново",
                2000, 0, 0, 0, 0, 0, 0, 0);
        insertCard(db, "10111", "Надо было следить за здоровьем, вы умерли(",
                R.drawable.img10111, "играть заново", "играть заново",
                0, 50, 0, 0, 0, 0, 0, 0);
        insertCard(db, "10112", "Надо было следить за здоровьем, вы умерли(",
                R.drawable.img10111, "Начать снова", "Начать снова",
                0, 50, 0, 0, 0, 0, 0, 0);
        insertCard(db, "11011", "Вы становитесь изгоем и вешаетесь",
                R.drawable.img11011, "Начать снова", "Начать снова",
                0, 0, 50, 0, 0, 0, 0, 0);
        insertCard(db, "11012", "Вы становитесь изгоем и вешаетесь",
                R.drawable.img11011, "играть заново", "играть заново",
                0, 0, 50, 0, 0, 0, 0, 0);
        insertCard(db, "11101", "Вас убили",
                R.drawable.img11101, "играть заново", "играть заново",
                0, 0, 0, 50, 0, 0, 0, 0);
        insertCard(db, "11102", "Вас убили",
                R.drawable.img11101, "Заново", "Заново",
                0, 0, 0, 50, 0, 0, 0, 0);

        // Сами карточки
        insertCard(db, "12121", "Денег мало, надо пойти поискать работу",
                R.drawable.img12121, "Да", "Нет, дальше пинать",
                3000, -30, +40, -30, -500, 0, -20, 0);
        insertCard(db, "12122", "По деньгам ваще беда, неплохо бы кого-нибудь ограбить",
                R.drawable.img12122, "Да", "Нет",
                8000, -20, -20, -10, -1000, 0, 0, 0);
        insertCard(db, "11121", "Нужно пойти на пробежку",
                R.drawable.img11121, "Да", "Нет",
                0, 20, 0, -20, 0, -10, -10, 0);
        insertCard(db, "11122", "Пора бросать курить",
                R.drawable.img11122, "Да", "Нет",
                1000, 30, 0, -30, -1000, -20, 0, 0);
        insertCard(db, "11111", "Есть касарь?",
                R.drawable.img11111, "Отпиздить дурака", "Да, вот держи",
                1000, -30, 20, -30, -1000, 20, -20, 20 );
        insertCard(db, "11112", "На улице стало слишком опасно, нужно подкачаться",
                R.drawable.img11112, "Да", "Все и так неплохо",
                0, 10, 0, 20, 0, -10, -10, -20);
        insertCard(db, "11221", "Ваш знакомый предлагает хорошую работу",
                R.drawable.img11221, "Да, нужны деньги", "Сам разберусь",
                15000, 0, 30, 0, -1000, 0, -30, 0);
        insertCard(db, "11222", "Знакомые доверяют вам и одалживают денег",
                R.drawable.img11222, "Вернуть деньги", "Не отдавать",
                0, 0, 30, 0, 10000, 0, -30, -20);
        insertCard(db, "21121", "Курнуть?",
                R.drawable.img21121, "Да", "Нет",
                -1000, 30, 0, 0, 0, -20, 0, 0);
        insertCard(db, "21122", "Нужно найти женщину",
                R.drawable.img21122, "Да", "Нет",
                -5000, 30, 30, 10, 1000, -20, -20, 0 );
        insertCard(db, "21111", "Купить травмат?",
                R.drawable.img21111, "Да", "Нет",
                -5000, 0, 20, 50, 0, 0, 0, -30);
        insertCard(db, "21112", "Вам предложили поучаствовать в наркобизнесе",
                R.drawable.img21112, "Да", "Нет",
                30000, -30, -20, -30, -2000, 0, 0, 30);
        insertCard(db, "21221",
                "Хочется пить. Что купить?",
                R.drawable.img21221, "Молоко", "Водка",
                -500, 10, 0, -30, -1000, -20, -30, -40);
        insertCard(db, "21222",
                "Записаться на йогу",
                R.drawable.img21222, "Шаулииинь!!&@", "Нет",
                -5000, 20, 20, -30, 0, -20, 0, 0);
        insertCard(db, "22121",
                "Бабуля переходит дорогу",
                R.drawable.img22121, "Помочь", "Задавить чёртову бабку!!",
                0, 0, 40, -40, 0, 0, -30, 0);
        insertCard(db, "22122",
                "Детям не продают пиво",
                R.drawable.img22122, "Купить им пива", "Гребаные малолетние дегенераты!",
                1000, 0, 30, 0, 0, 0, -30, 0);
        insertCard(db, "12221",
                "Пойти воевать на Донбасс",
                R.drawable.img12221, "Да", "???",
                100000, -50, 20, -50, 0, 20, -20, 20);
        insertCard(db, "12222",
                "Пойти бомбить у клуба",
                R.drawable.img12222, "Да", "Нет",
                5000, -30, -20, -40, 0, 0, -30, 0);
        insertCard(db, "11211",
                "Есть вариант подработать фитнес-тренером",
                R.drawable.img11211, "Да!", "Нет",
                2000, 30, -30, 0, 0, -10, 0, -20);
        insertCard(db, "11212",
                "Пойти работать на завод",
                R.drawable.img11212, "Ладно", "Нет",
                4000, -20, 20, 10, -1000, 20, -20, 0);
        insertCard(db, "12111",
                "Нужно поработать, вот хорошая вакансия грузчика",
                R.drawable.img12111, "Пойдет", "Не пойдет",
                4000, -30, 10, 10, -1000, 30, 0, 0);
        insertCard(db, "12112",
                "Продать почку?",
                R.drawable.img12112, "Да", "Не пойдет",
                100000, -60, 40, 0, -1000, 40, 0, 0);
        insertCard(db, "12211",
                "Спасибо за помощь, сынок",
                R.drawable.img12211, "Взять деньги", "Не брать",
                2000, 0, 0, 0, 0, 0, 10, 0);
        insertCard(db, "12212",
                "Дома стоит телевизор",
                R.drawable.img12212, "Продать", "Оставить",
                5000, 30, 0, 0, 0, -30, 0, 0);
        insertCard(db, "21211",
                "Пора поехать отдохнуть на море",
                R.drawable.img21211, "Да", "Денег нету",
                -10000, 40, 20, 0, 2000 , -20, 0, 0);
        insertCard(db, "21212",
                "Поехали на рыбалку!",
                R.drawable.img21212, "Да", "Денег нету",
                -5000, 30, 30, 0, 1000 , -20, 0, 0);
        insertCard(db, "22111",
                "Когда три касаря вернешь?",
                R.drawable.img22111, "Забирай", "Денег нету",
                -3000, 0, 40, 0, 0 , 0, -40, -20);
        insertCard(db, "22112",
                "Пора купить машину получше",
                R.drawable.img22112, "Пора", "Денег нету",
                -20000, 0, 40, 20, 0 , 0, -20, -20);
        insertCard(db, "22211",
                "Купить пистолет?",
                R.drawable.img22211, "Да", "Нет",
                -15000, 30, -30, 40, 1000 , 0, 0, -30);
        insertCard(db, "22212",
                "Эй уася есть закурить?",
                R.drawable.img22212, "Вот деньги, только не бей", "Сам ты Вася",
                -10000, -30, -50, 30, 0 , -20, 20, -30);
        insertCard(db, "22221",
                "У нас тут появился вариант поработать ментом",
                R.drawable.img22221, "Давай", "Нет, я честный",
                30000, -30, -60, -40, -5000 , 0, 30, -30);
        insertCard(db, "22222",
                "У нас тут директор ушел, не хочешь за него выйти?",
                R.drawable.img22222, "Давай", "Нет",
                15000, -40, 0, -30, -5000 , 0, -30, 0);
        insertCard(db, "31111",
                "Нужно срочно съездить на острова",
                R.drawable.img31111, "Да", "Нет",
                -30000, 40, 30, 0, 5000 , -20, -20, 0);
        insertCard(db, "31112",
                "Нужно срочно съездить на острова",
                R.drawable.img31111, "Да", "Нет",
                -30000, 40, 30, 0, 5000 , -20, -20, 0);
        insertCard(db, "31121",
                "Ну когда мы уже поженимся??",
                R.drawable.img31121, "Сейчас", "Не знаю",
                -20000, 40, 40, 20, 0 , -20, -20, -20);
        insertCard(db, "31122",
                "Ну когда мы уже поженимся??",
                R.drawable.img31121, "Сейчас", "Не знаю",
                -20000, 40, 40, 20, 0 , -20, -20, -20);
        insertCard(db, "31211",
                "Чиновники отжимают ваш бизнес",
                R.drawable.img31211, "Откупиться", "Рассказать прессе",
                -30000, 30, -30, 20, 0 , -20, 30, -30);
        insertCard(db, "31212",
                "Чиновники отжимают ваш бизнес",
                R.drawable.img31211, "Откупиться", "Рассказать прессе",
                -30000, 30, -30, 20, 0 , -20, 30, -30);
        insertCard(db, "31221",
                "Пойти в депутаты?",
                R.drawable.img31221, "Да", "Нет, я честный",
                -30000, 20, -40, 20, 0 , 0, 30, -20);
        insertCard(db, "31222",
                "Пойти в депутаты?",
                R.drawable.img31221, "Да", "Нет, я честный",
                -30000, 20, -40, 20, 0 , 0, 30, -20);
        insertCard(db, "32111",
                "На дом напали бандиты",
                R.drawable.img32111, "Спасать имущество", "Спасать семью",
                0, 0, -30, 30, -20000 , -20, 50, 50);
        insertCard(db, "32112",
                "На дом напали бандиты",
                R.drawable.img32111, "Спасать имущество", "Спасать семью",
                0, 0, -30, 30, -20000 , -20, 50, 50);
        insertCard(db, "32121",
                "Дорога у дома вся в ямах",
                R.drawable.img32121, "Сделать дорогу", "Жаловаться на власть",
                -50000, 0, 50, 40, 0 , -20, -20, 0);
        insertCard(db, "32122",
                "Дорога у дома вся в ямах",
                R.drawable.img32121, "Сделать дорогу", "Жаловаться на власть",
                -50000, 0, 50, 40, 0 , -20, -20, 0);
        insertCard(db, "32211",
                "Вот я придумал хороший бизнес, но придется попотеть",
                R.drawable.img32211, "Ну давай", "Нет",
                40000, -40, 0, 0, 0, 20, -40, 0);
        insertCard(db, "32212",
                "Вот я придумал хороший бизнес, но придется попотеть",
                R.drawable.img32211, "Ну давай", "Нет",
                40000, -40, 0, 0, 0, 20, -40, 0);
        insertCard(db, "32221",
                "Все слишком хорошо в жизни, надоело",
                R.drawable.img32221, "Суицид", "Бросить все",
                0, -100, 0, 0, -100000, -60, -60, -60);
        insertCard(db, "32222",
                "Все слишком хорошо в жизни, надоело",
                R.drawable.img32221, "Суицид", "Бросить все",
                0, -100, 0, 0, -100000, -40, -40, -40);
        /// строка с рекордом
        insertCard(db, "0000", "", 0, "", "", 0, 0,
                0, 0, 0, 0, 0, 18);

    }

    @Override
    public void onUpgrade(SQLiteDatabase db, int OldVersion, int NewVersion) {
    }

    public void insertCard(SQLiteDatabase db, String group, String text,
                           int resourceId, String leftbtn, String rightbtn,
                           int lpluscash, int lplushealth,
                           int lplusrespect, int lplusdanger,
                           int rpluscash, int rplushealth,
                           int rplusrespect, int rplusdanger) {
        ContentValues values = new ContentValues();
        values.put("NUMBER", group);
        values.put("TEXT", text);
        values.put("IMAGE_RESOURCE_ID", resourceId);
        values.put("LEFT_BTN_TXT", leftbtn);
        values.put("RIGHT_BTN_TXT", rightbtn);
        values.put("LEFT_CASH", lpluscash);
        values.put("LEFT_HEALTH", lplushealth);
        values.put("LEFT_RESPECT", lplusrespect);
        values.put("LEFT_DANGER", lplusdanger);
        values.put("RIGHT_CASH", rpluscash);
        values.put("RIGHT_HEALTH", rplushealth);
        values.put("RIGHT_RESPECT", rplusrespect);
        values.put("RIGHT_DANGER", rplusdanger);
        db.insert("CARDS", null, values);
    }
}
